<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"3a16a11b24fd39f2e018ad168a63b5d6695dc51873cfe845edb8f17969d99f58","plan_job_ref":"Job Create terraform plan #135 at https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/18815842748","plan_out_hash":"9299a7e59cfbf944df6e5d70468d9763efc5303640703493e76603aea44a906a","plan_hash":"ba2a333f0e99ce4fc7b15b329ce980114241e529fec2e1fbcbedb0f540426f28","plan_text_format":"diff","version":"2.2.2"} -->
OpenTofu plan in __infrastructure__
With backend config: `resource_group_name=rg-ProjectCoordinator-Deploy-prd
storage_account_name=stprdtfprojectcoordinato
container_name=tfstate
`<details open><summary>With variables</summary>

```hcl
environment                = "prd"
key_vault_name             = "kv-ProjectCoordi-prd-zgm"
open_route_service_api_key = (sensitive value)
redirect_uris_number       = 40
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # azuread_service_principal.api will be created
+   resource "azuread_service_principal" "api" {
+       account_enabled             = true
+       app_role_ids                = (known after apply)
+       app_roles                   = (known after apply)
+       application_tenant_id       = (known after apply)
+       client_id                   = "************************************"
+       display_name                = (known after apply)
+       homepage_url                = (known after apply)
+       id                          = (known after apply)
+       logout_url                  = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       oauth2_permission_scopes    = (known after apply)
+       object_id                   = (known after apply)
+       owners                      = [
+           "b7269a0e-d286-4aa1-94f9-1ff7eb2abfd3",
        ]
+       redirect_uris               = (known after apply)
+       saml_metadata_url           = (known after apply)
+       service_principal_names     = (known after apply)
+       sign_in_audience            = (known after apply)
+       tags                        = (known after apply)
+       type                        = (known after apply)

+       feature_tags (known after apply)

+       features (known after apply)
    }

  # azuread_service_principal.client will be created
+   resource "azuread_service_principal" "client" {
+       account_enabled             = true
+       app_role_ids                = (known after apply)
+       app_roles                   = (known after apply)
+       application_tenant_id       = (known after apply)
+       client_id                   = "************************************"
+       display_name                = (known after apply)
+       homepage_url                = (known after apply)
+       id                          = (known after apply)
+       logout_url                  = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       oauth2_permission_scopes    = (known after apply)
+       object_id                   = (known after apply)
+       owners                      = [
+           "b7269a0e-d286-4aa1-94f9-1ff7eb2abfd3",
        ]
+       redirect_uris               = (known after apply)
+       saml_metadata_url           = (known after apply)
+       service_principal_names     = (known after apply)
+       sign_in_audience            = (known after apply)
+       tags                        = (known after apply)
+       type                        = (known after apply)

+       feature_tags (known after apply)

+       features (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #135](https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/18815842748)